app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "It is a computer build in one piece"], ["created_at", "2015-01-18 16:07:09.255069"], ["title", "Laptop"], ["updated_at", "2015-01-18 16:07:09.255069"]]
---
  def create
    @article = Article.new(params_article)
    #@article.title = params[:article][:title]
    #@article.body = params[:article][:body]
    @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "updated_at" = ? WHERE "articles"."id" = 4  [["image_content_type", "image/jpeg"], ["image_file_name", "download.jpg"], ["image_file_size", 2608], ["updated_at", "2015-01-22 10:40:15.115435"]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(params_article)