app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 4], ["author_name", ""], ["body", ""], ["created_at", "2015-01-19 06:02:33.980090"], ["updated_at", "2015-01-19 06:02:33.980090"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]
    @comment.save